#შედარების ოპერატორები:
# > - მეტობა
# < - ნაკლებობა
# == - უდრის
# != - არ უდრის
# >= - მეტია ან ტოლია
# <= - ნაკლებია ან ტოლია

#ლოგიკური ოპერატორები:
# And - ლოგიკური ოპერატორი რის შემთხვევაშიხ თუ პირობის ორივე მხარეს არის true შედეგიც იქნება true,
# სხვა შემთხვევაში პასუხი იქნება false


# or - ლოგიკური ოპერატორი რის შემთხვევაშიც თუ ერთ-ერთი პირობა მაინც არის true შედეგიც იქნება
#true


# not - ლოგიკური ოპერატორი რომელიც ცვლის პირობას საპირისპიროდ.



# boolearn - არის იგივე  true/false ანუ რეალური ან არარეალური

print (True and not False) or (False and True) or (not (False or False) and True) and (True or not
(False and True))
#ჩვენ ჯერ ვხსნით ცალ-ცალკე ფრჩხილებში მოცემულ მაგალითებს პირველ რიგში ვიგებთ თუ რას გამოიტანს 
# პირველი
#ფრჩხილი ანუ (true and not false) იგი გამოიტანს trues შემდეგ ვიგებთ მეორეფრჩხილი რას გამოიტანს ანუ
# (false and true) და ის გამოიტანს false-ს შემდეგ მოდის (not(false or false)and true) აქ უკვე
#მოდის ორი ფრჩხილი ამიტომ ჯერ ვიგებთ თუ რას გამოიტანს (false or false) გამოიტანს false-ს
# ხოლო შემდეგ (not false and true) აქ not false გადაიქცევა true-დ და  გამოიტანს true-ს
# შემდეგი მაგალითიც ორ ფრჩხილიანია (true or not (false and true)) აქ ჯერ ვიგებთ თუ რას გამოიტანს
# (false and true) და გამოიტანს false-ს  ხოლო შემდეგ ვიგებთ თუ რას გაამოიტანს (true or not false)
#და გამოიტანს true-ს. საბოლოოდ გვრჩება (true or false or true and true) აქაც მივყვებით ჯერ ვიგებთ
# true or false რას გამოიტანს გამოიტანს trues შენდეგ ვიგებთ true or true-ს და გამოიტანს trues
# და ბოლოს true and true და გამოიტანს true-ს