# +__მიმატება
# -__ გამოკლება
# *__ გამრავლება
# /__გაყოფა
# //___ვიგებთ თუ რამდენჯერ მოთავსდება გამყოფი გასაყოფში
# / და // შორის განსხვავება არის ის რომ ჩეულებრივი გაყოფის(/) დროს ჩვენ ვიღებთ არამთელ
# რიცხვებს (ათწილადებს) ხოლო // გამოყენებისას მთელ რიცხვებს

a = 94
b = 5
print(a+b)
print(a-b)
print(a*b)
print(b/a)
print(b//a)


price = 49
price = 49-12

print(price)


score=100
score=100*35
print(score)



name='barbare'
name='sika'
name='salome'
print(name)
#ეს კოდი გამოიტანს "სალომეს" რადგან ჩვენ გამოვიყენეთ ცვლადის ერთი სახელი
# ანუ ყველგან გამოვიყენეთ 'name' ასევე ამის მიზეზი ისაა, რომ კომპიუტერი კითხულობს
# ზემოდან ქვემოთ.